country_groups = {
    "страны ЕАЭС": ["Россия", "Беларусь", "Армения", "Кыргызстан"],
    "страны ЕС": [
        "Австрия", "Бельгия", "Болгария", "Хорватия", "Кипр", "Чехия",
        "Дания", "Эстония", "Финляндия", "Франция", "Германия", "Греция",
        "Венгрия", "Ирландия", "Италия", "Латвия", "Литва", "Люксембург",
        "Мальта", "Нидерланды", "Польша", "Португалия", "Румыния", "Словакия",
        "Словения", "Испания", "Швеция"
    ],
    "страны СНГ": [
        "Азербайджан", "Армения", "Беларусь", "Кыргызстан",
        "Молдова", "Россия", "Таджикистан", "Узбекистан"
    ],
    "страны ЕАСТ": [
        "Исландия", "Лихтенштейн", "Норвегия", "Швейцария"
    ],
    "страны СНГ вне ЕАЭС": [
        "Азербайджан","Молдова", "Таджикистан", "Узбекистан"
    ],
    "страны страны Австралии и Океании": [
        "Австралия", "Американское Самоа", "Британская Территория в Индийском Океане",
        "Вануату", "Внешние малые острова США", "Гуам",
        "Кирибати", "Кокосовые острова", "Маршалловы Острова", "Микронезия",
        "Науру", "Ниуэ", "Новая Зеландия", "Новая Каледония",
        "Остров Норфолк", "Остров Рождества",
        "Херд и Макдональд", "Острова Кука", "Палау", "Папуа — Новая Гвинея",
        "Самоа", "Северные Марианские Острова", "Соломоновы Острова", "Восточный Тимор",
        "Токелау", "Тонга", "Тувалу", "Уоллис и Футуна",
        "Фиджи", "Французская Полинезия", "Южная Георгия и Южные Сандвичевы Острова" ### , "Питкерн"
    ],
    "страны Азии (без СНГ)": [
        "Афганистан", "Бангладеш", "Бахрейн", "Бруней",
        "Бутан", "Восточный Тимор", "Вьетнам",
        "Гонконг", "Грузия", "Израиль", "Индия",
        "Индонезия", "Иордания", "Ирак", "Иран",
        "Йемен", "Камбоджа", "Катар", "Китай",
        "КНДР", "Республика Корея", "Кувейт", "Лаос",
        "Ливан", "Макао", "Малайзия", "Мальдивы",
        "Монголия", "Мьянма", "Непал", "ОАЭ",
        "Оман", "Пакистан", "Государство Палестина",
        "Саудовская Аравия", "Сингапур", "Сирия", "Таиланд",
        "Китайская Республика", "Турция", "Филиппины", "Шри-Ланка", ### Под китайской республикой имеется в виду Тайвань (наверное)
        "Япония" ### , "Прочие страны Азии"
    ],
    "страны Америки": [
        "Ангилья", "Антигуа и Барбуда", "Аргентина",
        "Аруба", "Багамские Острова", "Барбадос", "Белиз",
        "Бермуды", "Боливия", "Бразилия", 
        "Венесуэла", "Виргинские Острова (Великобритания)", "Виргинские Острова (США)", "Гаити",
        "Гайана", "Гваделупа", "Гватемала",
        "Гондурас", "Гренада", "Гренландия", "Доминиканская Республика",
        "Канада", "Колумбия", "Коста-Рика", "Куба",
        "Кюрасао", "Синт-Мартен", "Бонайре, Синт-Эстатиус и Саба", "Внешние малые острова США", "Мартиника", "Мексика",
        "Монтсеррат", "Никарагуа", "Теркс и Кайкос",
        "Острова Кайман", "Панама", "Парагвай", "Перу", 
        "Пуэрто-Рико", "Сент-Винсент и Гренадины", "Сальвадор", 
        "Сен-Бартелеми", "Сент-Китс и Невис", "Сент-Люсия", "США",
        "Сен-Пьер и Микелон", "Тринидад и Тобаго", "Уругвай", "Фолклендские острова",
        "Гвиана", "Чили", "Эквадор",
        "Южная Георгия и Южные Сандвичевы Острова", "Ямайка", "Суринам"
    ],
    "страны Африки": [
        "Алжир", "Ангола", "Бенин", "Ботсвана",
        "Остров Буве", "Буркина-Фасо", "Бурунди", "Габон",
        "Гамбия", "Гана", "Гвинея", "Гвинея-Бисау",
        "ДР Конго", "Джибути", "Египет", "Замбия",
        "Зимбабве", "Кабо-Верде", "Камерун",
        "Кения", "Коморы", "Республика Конго", "Кот-д’Ивуар",
        "Лесото", "Либерия", "Ливия", "Маврикий",
        "Мавритания", "Мадагаскар", "Майотта", "Малави",
        "Мали", "Марокко", "Мозамбик", "Намибия",
        "Нигер", "Нигерия", "Остров Святой Елены", "Реюньон",
        "Руанда", "Сан-Томе и Принсипи", 
        "Сейшельские Острова", "Сенегал", "Сьерра-Леоне", "Сомали",
        "Судан", "Танзания", "Того",
        "Тунис", "Уганда", "Французские Южные и Антарктические территории", "ЦАР",
        "Чад", "Экваториальная Гвинея", "Эритрея", "Эфиопия",
        "ЮАР", "Южный Судан" ### , "Западная Сахара", "Св.Елена, О.Вознесения,Тр.-Да-Кунья", "Эсватини"
    ],
    "страны Европы (вне ЕС и ЕАСТ и ЕАЭС)": [
        "Албания", "Андорра", "Босния и Герцеговина",
        "Гибралтар", "Северная Македония",
        "Монако", "Великобритания", "Ватикан",
        "Сан-Марино", "Сербия",
        "Черногория" ### , "Гернси", "Джерси", "Фарерские острова", "Остров Мэн", "Прочие европейские страны"
    ],
    "весь мир": ['Австралия', 'Австрия', 'Азербайджан', 'Аландские острова', 'Албания', 'Алжир', 'Американское Самоа', 'Ангилья', 'Ангола', 'Андорра', 'Антарктика', 'Антигуа и Барбуда', 'Аргентина', 'Армения', 'Аруба', 'Афганистан', 'Багамские Острова', 'Бангладеш', 'Барбадос', 'Бахрейн', 'Белиз', 'Беларусь', 'Бельгия', 'Бенин', 'Бермуды', 
                 'Болгария', 'Боливия', 'Бонайре, Синт-Эстатиус и Саба', 'Босния и Герцеговина', 'Ботсвана', 'Бразилия', 'Британская Территория в Индийском Океане', 'Бруней', 'Буркина-Фасо', 'Бурунди', 'Бутан', 'Вануату', 'Ватикан', 'Великобритания', 'Венгрия', 'Венесуэла', 'Виргинские Острова (Великобритания)', 'Виргинские Острова (США)', 
                 'Внешние малые острова США', 'Восточный Тимор', 'Вьетнам', 'Габон', 'Гаити', 'Гайана', 'Гамбия', 'Гана', 'Замбия', 'Гваделупа', 'Гватемала', 'Гвиана', 'Гвинея', 'Гвинея-Бисау', 'Германия', 'Гернси', 'Гибралтар', 'Гондурас', 'Гонконг', 'Государство Палестина', 'Гренада', 'Гренландия', 'Греция', 'Грузия', 'Гуам', 'Дания', 
                 'ДР Конго', 'Джерси', 'Джибути', 'Доминика', 'Доминиканская Республика', 'Египет', 'Зимбабве', 'Израиль', 'Индия', 'Индонезия', 'Иордания', 'Ирак', 'Иран', 'Ирландия', 'Исландия', 'Испания', 'Италия', 'Йемен', 'Кабо-Верде', 'Казахстан', 'Камбоджа', 'Камерун', 'Канада', 'Катар', 'Кения', 'Кипр', 'Кыргызстан', 'Кирибати', 
                 'Китайская Республика', 'Китай', 'КНДР', 'Кокосовые острова', 'Колумбия', 'Коморы', 'Коста-Рика', 'Кот-д’Ивуар', 'Куба', 'Кувейт', 'Кюрасао', 'Лаос', 'Латвия', 'Лесото', 'Либерия', 'Ливан', 'Ливия', 'Литва', 'Лихтенштейн', 'Люксембург', 'Маврикий', 'Мавритания', 'Мадагаскар', 'Майотта', 'Макао', 'Северная Македония', 
                 'Малави', 'Малайзия', 'Мали', 'Мальдивы', 'Мальта', 'Марокко', 'Мартиника', 'Маршалловы Острова', 'Мексика', 'Микронезия', 'Мозамбик', 'Молдова', 'Монако', 'Монголия', 'Монтсеррат', 'Мьянма', 'Намибия', 'Науру', 'Непал', 'Нигер', 'Нигерия', 'Нидерланды', 'Никарагуа', 'Ниуэ', 'Новая Зеландия', 'Новая Каледония', 
                 'Норвегия', 'ОАЭ', 'Оман', 'Остров Буве', 'Остров Мэн', 'Остров Норфолк', 'Остров Рождества', 'Острова Кайман', 'Острова Кука', 'Острова Питкэрн', 'Остров Святой Елены', 'Пакистан', 'Палау', 'Панама', 'Папуа — Новая Гвинея', 'Парагвай', 'Перу', 'Польша', 'Португалия', 'Пуэрто-Рико', 'Республика Конго', 'Республика Корея',
                 'Реюньон', 'Россия', 'Руанда', 'Румыния', 'САДР', 'Сальвадор', 'Самоа', 'Сан-Марино', 'Сан-Томе и Принсипи', 'Саудовская Аравия', 'Северные Марианские Острова', 'Сейшельские Острова', 'Сен-Бартелеми', 'Сен-Мартен', 'Сен-Пьер и Микелон', 'Сенегал', 'Сент-Винсент и Гренадины', 'Сент-Китс и Невис', 'Сент-Люсия', 'Сербия', 
                 'Сингапур', 'Синт-Мартен', 'Сирия', 'Словакия', 'Словения', 'Соломоновы Острова', 'Сомали', 'Судан', 'Суринам', 'США', 'Сьерра-Леоне', 'Таджикистан', 'Таиланд', 'Танзания', 'Теркс и Кайкос', 'Того', 'Токелау', 'Тонга', 'Тринидад и Тобаго', 'Тувалу', 'Тунис', 'Туркменистан', 'Турция', 'Уганда', 'Узбекистан', 'Украина', 
                 'Уоллис и Футуна', 'Уругвай', 'Фарерские острова', 'Фиджи', 'Филиппины', 'Финляндия', 'Фолклендские острова', 'Франция', 'Французская Полинезия', 'Французские Южные и Антарктические территории', 'Херд и Макдональд', 'Хорватия', 'ЦАР', 'Чад', 'Черногория', 'Чехия', 'Чили', 'Швейцария', 'Швеция', 'Шпицберген и Ян-Майен', 
                 'Шри-Ланка', 'Эквадор', 'Экваториальная Гвинея', 'Эритрея', 'Эсватини', 'Эстония', 'Эфиопия', 'ЮАР', 'Южная Георгия и Южные Сандвичевы Острова', 'Южный Судан', 'Ямайка', 'Япония']
}