groups_country_groups = [
    ["группы из СВОД", None],
    ["страны ЕАЭС", "группы из СВОД"],
    ["страны СНГ (без ЕАЭС)", "группы из СВОД"],
    ["страны ДЗ", "группы из СВОД"],
    ["страны ЕАСТ", "группы из СВОД"],
    ["страны ЕС", "группы из СВОД"],
    ["страны СНГ", "группы из СВОД"],
    ["страны Австралии и Океании", "группы из СВОД"],
    ["страны Азии (без СНГ)", "группы из СВОД"],
    ["страны Америки", "группы из СВОД"],
    ["страны Африки", "группы из СВОД"],
    ["страны Европы (вне ЕС и ЕАСТ и ЕАЭС)", "группы из СВОД"],
    ["Другое", None],
    ["страны ЦА", "Другое"],
    ["весь мир", "Другое"]
]